---
kind: method
id: M:Autodesk.Revit.UI.Events.SelectionChangedEventArgs.GetReferences
source: html/feeab385-746d-f24c-e480-8c88a7275d01.htm
---
# Autodesk.Revit.UI.Events.SelectionChangedEventArgs.GetReferences Method

Returns the references that are currently selected.

## Syntax (C#)
```csharp
public IList<Reference> GetReferences()
```

## Returns
The collection containing the selected references.

## Remarks
The references can be an element or subelement in the host or a linked document.